app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("content", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "testy"], ["status", 2], ["created_at", "2016-07-24 16:16:03.498447"], ["updated_at", "2016-07-24 16:16:03.498447"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "start_task" = ?, "end_task" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["start_task", "2016-08-01 23:45:00.000000"], ["end_task", "2016-08-02 04:45:00.000000"], ["updated_at", "2016-07-31 17:48:09.690816"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)